ingredients = [
    'Булочка с кунжутом',
    'Булочка',
    'Котлета',
    'Огурец',
    'Помидор',
    'Майонез',
    'Сыыыыр',
]

def add_bun():
    print('Залог бургера - булочка с кунжутом')

def add_cutlet():
    print('Бахнем котлетосик')

def add_cucumber():
    print('Накинем корнишончиков')

def add_tomato():
    print('Немного слайсов помидоров ещё никого не убили')

def add_cheese():
    print('Чем больше сыра - тем больше дырок. Чем больше дырок - тем меньше сыра. Больше сыра - меньше сыра')

def add_mayonnaise():
    print('С таким количество майонеза не видать тебе ПП')

def add_seasoning():
    print('Присыпим приправкой для вкуса')

def add_nude_bun():
    print('Булочки без кунжута тоже иногда бывают вкусны')